%-------------レポート課題1 (2クラス物体分類実験)-----------------------%
%              (1)カラーヒストグラムと最近傍分類
%
%               getVector64.m
%
%------------------------------------------------------------------%
function rsl = getVector64(imgPath)
%------------------------------------------------------------------%
%
%         画像リンクを受け取り、その画像リンク
%         先の画像のColorHistgramを返す
% 
%
%------------------------------------------------------------------%
X = imread(imgPath);
R = X(:,:,1);
G = X(:,:,2);
B = X(:,:,3);

X64 = floor(double(R)/64) * 4 * 4 + floor(double(G) / 64) * 4 + floor(double(B) / 64 ) * 1;

X64_vec=reshape(X64,1,numel(X64));
h = histcounts(X64_vec,[0:63]);

rsl = h / sum(h);

